
// TODO: better name for this file

#include "bmfx.h"
#include "common.h"

#include "armfunc.h"
#include "hardware.h"
#include "oam.h"
#include "icon.h"
#include "sound.h"
#include "sprite.h"
#include "face.h"
#include "sprite-anim.h"
#include "util.h"
#include "msg.h"
#include "bm.h"
#include "item.h"
#include "unit.h"
#include "map.h"
#include "mapwork.h"
#include "menu.h"
#include "faction.h"
#include "unitsprite.h"
#include "battle.h"
#include "trap.h"
#include "bmio.h"
#include "supply.h"
#include "chapter-info.h"
#include "subtitle-help.h"
#include "mu.h"

#include "constants/video-global.h"
#include "constants/pids.h"
#include "constants/jids.h"
#include "constants/icons.h"
#include "constants/songs.h"

extern u16 gChapterIntroMotifTmBuf[];

struct RescueTransferAnimProc
{
    /* 00 */ PROC_HEADER;

    /* 2C */ int facing;
    /* 30 */ struct Unit* unit;
    /* 34 */ struct MuProc* mu;
    /* 38 */ u8 movescr[4];
    /* 3C */ bool unk_3C;
};

struct EquipInfoWindowProc
{
    /* 00 */ PROC_HEADER;

    /* 2C */ struct Unit* unit;
    /* 30 */ u8 x;
    /* 31 */ u8 y;
    /* 32 */ u8 iconPalid;
    /* 33 */ i8 compareWeaponSlot;
    /* 34 */ struct Text text[3];
};

struct UnkProc2
{
    /* 00 */ PROC_HEADER;

    /* 2C */ struct Unit* unit;
    /* 30 */ short unk_30;
    /* 32 */ short unk_32;
    /* 34 */ short unk_34;
    /* 36 */ short unk_36;
    /* 38 */ int pad_38;
    /* 3C */ short unk_3C;
    /* 3E */ short unk_3E;
    /* 40 */ int pad_40;
    /* 44 */ int unk_44;
};

struct ShowMapChangeProc
{
    /* 00 */ PROC_HEADER;

    /* 2C */ int mcId;
    /* 30 */ int altSong;
    /* 34 */ int sndx;
};

static void RescueTransferSpriteAnim_Loop(struct RescueTransferAnimProc* proc);

struct ProcScr CONST_DATA ProcScr_RescueTransferAnim[] =
{
    PROC_19,

    PROC_REPEAT(RescueTransferSpriteAnim_Loop),

    PROC_END,
};

struct ProcScr CONST_DATA ProcScr_RescueTransferAnimParentless[] =
{
    PROC_19,

    PROC_CALL(LockGame),
    PROC_REPEAT(RescueTransferSpriteAnim_Loop),
    PROC_CALL(UnlockGame),

    PROC_END,
};

static void MapFade_Init(struct GenericProc* proc);
static void MapFade_Loop(struct GenericProc* proc);
static void MapFade_End(struct GenericProc* proc);

struct ProcScr CONST_DATA ProcScr_MapFade[] =
{
    PROC_19,
    PROC_END_IF_DUP,

    PROC_ONEND(MapFade_End),

    PROC_CALL(MapFade_Init),

    PROC_CALL(MapFade_Loop),
    PROC_REPEAT(MapFade_Loop),

    PROC_END,
};

static void InitPhaseCursor_Init(ProcPtr proc);

struct ProcScr CONST_DATA ProcScr_InitPhaseCursor[] =
{
    PROC_CALL(InitPhaseCursor_Init),
    PROC_SLEEP(0),

