#include "common.h"

#include "gbaio.h"
#include "armfunc.h"
#include "hardware.h"
#include "oam.h"
#include "sound.h"
#include "sprite.h"
#include "spriteanim.h"
#include "gamecontroller.h"
#include "util.h"
#include "ui.h"
#include "helpbox.h"
#include "save_core.h"
#include "save_game.h"

#include "constants/songs.h"
#include "constants/msg.h"

#include "constants/videoalloc_global.h"

enum
{
    BGCHR_SAVEMENU_0 = 0,
    BGCHR_SAVEMENU_2_0 = 0, // 8000

    OBJCHR_SAVEMENU_1C0 = 0x1C0,
    OBJCHR_SAVEMENU_200 = 0x200,

    OBJPAL_SAVEMENU_9 = 9,

    OBJPAL_SAVEMENU_1 = 1,
    OBJPAL_SAVEMENU_2 = 2,
};

enum
{
    L_SAVEMENU_BEGIN = 0,
    L_SAVEMENU_1 = 1,
    L_SAVEMENU_2 = 2,
    L_SAVEMENU_3 = 3,
    L_SAVEMENU_4 = 4,
    L_SAVEMENU_5 = 5,
    L_SAVEMENU_6 = 6,
    L_SAVEMENU_7 = 7,
    L_SAVEMENU_8 = 8,
    L_SAVEMENU_9 = 9,
    L_SAVEMENU_10 = 10,
    L_SAVEMENU_11 = 11,
    L_SAVEMENU_12 = 12,
    L_SAVEMENU_13 = 13,
    L_SAVEMENU_14 = 14,
    L_SAVEMENU_15 = 15,
    L_SAVEMENU_16 = 16,
};

enum
{
    UNK_SAVEMENU_0 = 1 << 0,
    UNK_SAVEMENU_1 = 1 << 1,
    UNK_SAVEMENU_2 = 1 << 2,
    UNK_SAVEMENU_3 = 1 << 3,
    UNK_SAVEMENU_4 = 1 << 4,
    UNK_SAVEMENU_5 = 1 << 5,
    UNK_SAVEMENU_6 = 1 << 6,
    UNK_SAVEMENU_7 = 1 << 7,
};

struct UnkProc_0868A28C;

struct SaveMenuProc
{
    /* 00 */ PROC_HEADER;
    /* 29 */ u8 anim_clock;
    /* 2A */ u8 unk_2A;
    /* 2B */ u8 selected_id;
    /* 2C */ u8 copy_from_id;
    /* 2D */ u8 unk_2D; // proc label
    /* 2E */ u8 unk_2E;
    /* 2F */ u8 unk_2F;
    /* 30 */ u8 unk_30;
    /* 31 */ u8 unk_31;
    /* 32 */ u8 unk_32;
    /* 33 */ u8 unk_33;
    /* 34 */ u8 unk_34;
    /* 35 */ u8 unk_35;
    /* 36 */ u8 unk_36;
    /* 37 */ u8 unk_37[3]; // unsure of length
    /* 3A */ u8 unk_3A[3];
    /* 3D */ u8 unk_3D;
    /* 3E */ u8 unk_3E;
    /* 3F */ u8 unk_3F;
    /* 40 */ u16 unk_40;
    /* 42 */ u16 unk_42;
    /* 44 */ u32 unk_44[3]; // time value
    /* 50 */ u32 unk_50; // time value
    /* 54 */ struct UnkProc_0868A28C * unk_54;
    /* 58 */ ProcPtr unk_58;
    /* 5C */ ProcPtr unk_5C; // sprite anim proc
};

struct SaveMenuUnkPalProc
{
    /* 00 */ PROC_HEADER;
    /* 29 */ u8 unk_29;
};

struct UnkProc_0868A28C
{
    /* 00 */ PROC_HEADER_EXT(struct SaveMenuProc);
    /* 29 */ STRUCT_PAD(0x29, 0x2A);
    /* 2A */ u16 unk_2A;
    /* 2C */ u16 unk_2C;
    /* 2E */ u16 unk_2E;
    /* 30 */ u16 unk_30;
    /* 30 */ u8 unk_32;
    /* 33 */ u8 unk_33;
    /* 34 */ ProcPtr unk_34;
    /* 38 */ STRUCT_PAD(0x38, 0x39);
    /* 39 */ u8 unk_39;
    /* 3A */ u8 unk_3A;
    /* 3B */ u8 unk_3B;
    /* 3C */ u8 unk_3C;
};

struct UnkProc_0868A2AC
{
    /* 00 */ PROC_HEADER;
    /* 29 */ STRUCT_PAD(0x29, 0x2A);
    /* 2A */ u16 unk_2A;
    /* 2C */ u16 unk_2C;
    /* 2E */ STRUCT_PAD(0x2E, 0x30);
    /* 30 */ struct SaveMenuProc * sm_proc;
    /* 34 */ u8 unk_34;
    /* 35 */ u8 unk_35;
    /* 36 */ u8 unk_36;
    /* 37 */ u8 unk_37;
    /* 38 */ u8 unk_38;
    /* 39 */ u8 unk_39;
    /* 3A */ u8 unk_3A;
    /* 3B */ u8 unk_3B;
    /* 3C */ STRUCT_PAD(0x3C, 0x3D);
    /* 3D */ u8 unk_3D;
};

extern u16 const gUnk_083278AC[]; // pal x2
extern u8 const gUnk_083278EC[]; // tsa
extern u16 const gUnk_0832BDE8[]; // pal x8
extern u8 const gUnk_0832A29C[]; // lz img
extern u8 const gUnk_0832B554[]; // lz img

extern u8 const gUnk_083280B0[]; // lz img
extern u8 const gUnk_0832A130[]; // affine tm (spinny boi)

extern u16 const gUnk_0832C39C[]; // sprite anim

struct Unk_0868A518
{
    /* 00 */ u16 const * sprite;
    /* 04 */ u8 unk_04;
};

extern struct Unk_0868A518 gUnk_0868A4F8[];
extern struct Unk_0868A518 gUnk_0868A518[];

extern u16 const * gUnk_0868A550[]; // sprites
extern u16 const * gUnk_0868A55C[]; // sprites

void func_fe6_0808A918(fu8 arg_0, struct SaveMenuProc * proc);
void func_fe6_0808A42C(void);
void func_fe6_0808A524(struct SaveMenuProc * proc);
int func_fe6_0808AA54(int arg_0, struct SaveMenuProc * proc);
void func_fe6_0808A9F4(int save_id);
struct UnkProc_0868A28C * func_fe6_0808A14C(struct SaveMenuProc * parent);
struct UnkProc_0868A2AC * func_fe6_0808A210(struct SaveMenuProc * parent);
int func_fe6_0808A658(fu8 save_id, int arg_1, int arg_2);
bool func_fe6_0808A6C8(struct SaveMenuProc * proc, int arg_1);
void func_fe6_0808A4B8(struct SaveMenuProc * proc, int arg_1);
void func_fe6_0808A454(char const * string, bool arg_1);
bool func_fe6_0808A79C(struct SaveMenuProc * proc);
bool func_fe6_08088EB8(struct SaveMenuProc * proc, int direction);
